import React from 'react';
import './PrivacyPolicy.scss';

export default function PrivacyPolicy() {
  return (
    <div className="PrivacyPolicy">
      <p className="PrivacyPolicy__text">
        1. Персональні дані користувачів сайту обробляються на захищених серверах, розташованих як у межах, так і поза межами Європейського економічного простору.
      </p>
      <p className="PrivacyPolicy__text">
        2. Інформація про реєстрацію: При створенні Користувачем облікового запису на Сайті, Компанія може вимагати певну інформацію, таку як - географічне розташування,
        дійсну адресу електронної пошти та пароль. Обліковий запис включає в себе таку інформацію про них, як географічне розташування, ім'я та прізвище, номер телефону і
        супутню інформацію, в тому числі фотографії, які вони можуть завантажувати у свій обліковий запис. (Обліковий запис дозволяє користувачам зв'язуватися один з
        одним, щоб висловити зацікавленість у своїх пропозиціях). Користувачі несуть відповідальність за всю інформацію, що розміщується ними в загальнодоступних
        облікових записах. Користувач повинен усвідомити всі ризики, пов'язані з тим, що він оприлюднює адресу або інформацію про точне місце свого розташування.
      </p>
      <p className="PrivacyPolicy__text">
        3. Ця Політика конфіденційності описує встановлений Компанією порядок обробки персональних даних, зібраних за допомогою Сайту (далі - Сайт), мобільного додатку
        (далі - мобільний додаток) і пов'язаних з ними послуг і інструментів, що дозволяють користувачам реєструватися на Сайті, публікувати або переглядати в режимі
        реального часу вже опубліковані оголошення. У всіх зазначених випадках Компанія обробляє персональні дані користувачів виключно в рамках вимог Закону України «Про
        захист персональних даних» та Конвенції про захист осіб у зв'язку з автоматизованою обробкою персональних даних. Ця Політика конфіденційності розроблена
        відповідно до положень цих документів.
      </p>
      <p className="PrivacyPolicy__text">
        4. Оголошення та Угоди: В рамках діяльності свого Сайту, Компанія може розміщувати інформацію, в тому числі особистого і контактного характеру, необхідну для
        здійснення угод між зацікавленими особами, для надсилання повідомлень і спілкування користувачів між собою є можливість дізнатися номер телефону користувача або
        написати йому повідомлення за межами сайту. Вся інформація, необхідна для публікації оголошень, потрібна для створення облікового запису. Користувачі несуть
        відповідальність за всю інформацію, що розміщується ними на Сайті. Користувач повинен уважно усвідомити всі ризики, пов'язані з тим, що він оприлюднює адресу, або
        інформацію особистого характеру.
      </p>
      <p className="PrivacyPolicy__text">
        5. Обслуговування клієнтів: При зверненні користувачів до відділу обслуговування клієнтів, Компанія, при необхідності, може в процесі роботи свого Сайту збирати
        особисту інформацію, необхідну для виконання запиту Користувача і отримання зворотного зв'язку. Компанія може також зв'язатися з Користувачем, використовуючи
        існуючу контактну інформацію облікового запису, надану для цієї мети. Компанія може також збирати іншу інформацію про спілкування з Користувачами, наприклад,
        будь-які запити до служби підтримки, що подаються Користувачами, або будь-який зворотний зв'язок, що надається ними, зокрема, у формі відгуків, залишених
        Користувачами. Ми можемо обробляємо відгуки в якості даних, що стосуються Користувача – автора відгуку, та Користувача, відносно якого було залишено відгук.
      </p>
      <p className="PrivacyPolicy__text">
        6. Веб-сайт та мобільні дані: Компанія може автоматично отримувати і реєструвати на своїх серверах інформацію з браузера користувача або будь-якого пристрою,
        включаючи IP-адресу, геолокацію Користувача програмне забезпечення і апаратні атрибути, сторінки, які запитує Користувач, дані, які містяться в базах даних
        браузера, включаючи SQL бази даних, мобільні ідентифікатори (включаючи ідентифікатори мобільних пристроїв, такі як Google Advertisement ID, IFA or IFV),
        інформацію про використання додатків, та/або інформацію про інші використовувані пристрої, або інформацію системного рівня. Це може відбуватися на Сайті або на
        мобільному додатку, або на сервісах третіх осіб. Додаткова інформація про те, як користувачі можуть контролювати та/або блокувати такий збір інформації
        знаходиться нижче в розділі 6 цієї політики.
      </p>
      <p className="PrivacyPolicy__text">
        7. Інформація, отримана в результаті опитувань: Компанія може збирати та зберігати інформацію, що отримана в результаті опитувань, що можуть проводитись
        Компанією, або залученими Компанією підрядниками, - третіми особами, а саме інформацію щодо статі, віку, сімейного стану, особистих вподобань та ін.
      </p>
      <p className="PrivacyPolicy__text">
        8. Інформація, що додається: Компанія може також додати інформацію, отриману на законних підставах від ділових партнерів або третіх сторін, до існуючих даних
        Компанії про своїх користувачів.
      </p>
      <p className="PrivacyPolicy__text">
        9. Реєструючись на Сайті, або здійснюючи вхід на Сайт за допомогою google акаунту, Користувач надає Компанії згоду на збір та обробку інформації.
      </p>
    </div>
  );
}
